Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: <html>Candidates for method call <b>{0}</b> are:<br><br>{1}</html>
zh_cn: <html>调用 <b>{0}</b> 的方法候选是:<br><br>{1}</html>

source: <html>Candidates for new <b>{0}</b>() are:<br>{1}</html>
zh_cn: <html>new <b>{0}</b>() 的候选是:<br>{1}</html>

source: <html>Change font size (Zoom) with Command+Mouse Wheel</html>
zh_cn: <html>用 Command+鼠标滚轮改变字体大小(缩放)</html>

source: <html>Change font size (Zoom) with Ctrl+Mouse Wheel</html>
zh_cn: <html>用 Ctrl+鼠标滚轮改变字体大小(缩放)</html>

source: <html>Create {0} with pre-defined support for your favourite framework/technology</html>
zh_cn: <html>创建 {0} 预定义的支持为您喜欢的框架/技术</html>

source: <html>Create {0} {1} from external model ({2})</html>
zh_cn: <html>从外部模型 ({2}) 创建 {0} {1}</html>

source: <html>Create {0} {1} structure over existing sources</html>
zh_cn: <html>从现有源创建 {0} {1}</html>

source: <html>Double-click on element to put into default location<br>Drag-and-drop element to add into the desired location<br>More actions are available in the popup menu</html>
zh_cn: <html>双击元素以放入默认位置<br>拖放元素添加到所需的位置<br>弹出菜单中有更多操作可用</html>

source: <html>Enable Drag'n'Drop functionality in editor</html>
zh_cn: <html>在编辑窗口中启用拖放功能</html>

source: <html>End of line comments sequence</html>
zh_cn: <html>行结束注释序列</html>

source: <html>Failed to change read-only status for the following files:<br>{0}</html>
zh_cn: <html>未能更改下列文件的只读状态:<br>{0}</html>

source: <html>Generic constructor and method parameters</html>
zh_cn: <html>通用构造函数和方法参数</html>

source: <html>Help Make {0} Better
zh_cn: <html>帮助使 {0} 更好

source: <html>Help improve {0} by sending anonymous usage statistics to {1}
zh_cn: <html>帮助改进 {0} ，通过发送匿名的使用统计数据到 {1}

source: <html>Honor "CamelHumps" words settings when selecting on<br/>double click</html>
zh_cn: <html>优先选中（Honor）驼峰单词在使用<br/>双击选择时。（这里不知道翻译对没，我在 AndroidStudio 上测试没有作用。）</html>

source: <html>I18n strings</html>
zh_cn: <html>国际化字符串</html>

source: <html>Inherited from <a href="{0}">{1}</a> spectrum:</html>
zh_cn: <html>继承 <a href="{0}">{1}</a> 谱:</html>

source: <html>Inline parameter names for literal call arguments</html>
zh_cn: <html>文本调用参数的内联参数名称</html>

source: <html>Manage external JavaDocs attached to this module.
zh_cn: <html>管理附加到此模块的外部 JavaDocs。

source: <html>Manage external annotations attached to this module.</html>
zh_cn: <html>管理附加到此模块的外部注解。</html>

source: <html>Maximum number of contents to keep in clipboard:</html>
zh_cn: <html>保留在剪贴板中的内容的最大数量：</html>

source: <html>Modules are grouped in the IDE accordingly to their names; <br>if names of several modules have a common prefix they will be shown together.</html>
zh_cn: <html>模块根据其名称在 IDE 中分组; <br>如果几个模块的名称有一个共同的前缀，它们将一起显示。</html>

source: <html>No candidates found for method call <b>{0}</b>.</html>
zh_cn: <html>没有找到调用 <b>{0}</b> 的方法候选。</html>

source: <html>No updates were found for plugins.<br> Unable to check for {0} updates as they are managed by {1}.</html>
zh_cn: <html>未发现插件更新。<br>无法检查由 {1} 管理的 {0} 更新。</html>

source: <html>Number of lines annotated by {0} is not equal to number of lines in the file.
zh_cn: <html>由 {0} 注释的行数不等于文件中的行数。

source: <html>One-line methods<html>
zh_cn: <html>单行方法<html>

source: <html>Please select the desired technologies.<br>This will download all needed libraries and create Facets in project configuration.</html>
zh_cn: <html>请选择所需的技术。<br>这将下载所有需要的库，并在项目配置中创建 Facet 。</html>

source: <html>Related file found: <code>{0}</code>.<br/>Delete it as well?</html>
zh_cn: <html>找到相关文件: <code>{0}</code>.<br/>一样删除它?</html>

source: <html>Related file found: <code>{0}</code>.<br/>Move it as well?</html>
zh_cn: <html>找到相关文件: <code>{0}</code>.<br/>一样移动它?</html>

source: <html>Related files found: <br/><code>{0}</code><br/><br/>Delete them as well?</html>
zh_cn: <html>找到相关文件: <br/><code>{0}</code><br/><br/>一样删除它们?</html>

source: <html>Related files found: <br/><code>{0}</code><br/><br/>Move them as well?</html>
zh_cn: <html>找到相关文件: <br/><code>{0}</code><br/><br/>一样移动它们?</html>

source: <html>Report @NotNull &parameters overriding @Nullable and <br>@Nullable methods overriding @NotNull</html>
zh_cn: <html>报告 @NotNull 参数覆盖 @Nullable 和<br> @Nullable 方法覆盖 @NotNull </html>(&P)

source: <html>Semantic highlighting<br><font color=gray><sub>Assign each parameter and local variable its<br>own color picked from spectrum below</sub></font></html>
zh_cn: <html>语义高亮<br><font color=gray><sub>分配每个参数和局部变量其自己的颜色<br>从下面的光谱中选出</sub></font></html>

source: <html>Show &options before removing<br>from version control</html>
zh_cn: <html>从版本控制中删除前<br>显示选项</html>(&O)

source: <html>Show options before adding<br>to version control</html>
zh_cn: <html>在添加到版本控制前<br>显示选项</html>

source: <html>Simple property accessors<html>
zh_cn: <html>简单属性访问器<html>

source: <html>Specify which libraries are used in specific files and/or directories</html>
zh_cn: <html>指定在特定文件和/或目录中使用哪些库</html>

source: <html>Spectrum:</html>
zh_cn: <html>谱:</html>

source: <html>Submit report anonymously or use <a>JetBrains Account...</a></html>
zh_cn: <html>匿名或使用<a>JetBrains 帐户...</a> 提交报告</html>

source: <html>Submit report as <a>{0}</a></html>
zh_cn: <html>以 <a>{0}</a> 提交报告</html>

source: <html>Suggest private for inner class members when referenced from outer class only</html>
zh_cn: <html>为仅从外部类引用的内部类成员建议为 private</html>

source: <html>Test results exported successfully to <a href="#a">{0}</a></html>
zh_cn: <html>测试结果成功导出到<a href="#a">{0}</a></html>

source: <html>The JRE you are running {0} with<br>is known to have performance issues<br>related to ligatures support.<br>Use <a href="https://confluence.jetbrains.com/display/IDEADEV/JetBrains+Runtime+Environment">JetBrains Runtime</a> instead to enable ligatures.
zh_cn: <html>您正在运行的 JRE {0} 已知具有与连字支持相关的性能问题。<br>使用 <a href="https://confluence.jetbrains.com/display/IDEADEV/JetBrains+Runtime+Environment">JetBrains Runtime</a> 来启用连字。

source: <html>The chunks listed below use more then one custom compiler.<br/>for them you will need to resolve conflict between<br/>compilers manually.
zh_cn: <html>下面列出的块使用多个自定义编译器。<br/>你需要为它们手动解决编译器<br/>冲突。

source: <html>The code fragment which you have pasted uses classes that are not accessible by imports in the new context.<br/>Select classes that you want to import to the new file.</html>
zh_cn: <html>您粘贴的代码片段使用的是在新上下文中导入时不可访问的类。<br/>选择您要导入到新文件的类。</html>

source: <html>The code fragment which you have pasted uses elements that are not accessible by imports in the new context.<br/>Select elements that you want to import to the new file.</html>
zh_cn: <html>您粘贴的代码片段使用的是在新上下文中导入时不可访问的元素。<br/>选择您要导入到新文件的元素。</html>

source: <html>The following {0, choice, 1#directory|2#directories} will be deleted.
zh_cn: <html>以下目录将被删除。

source: <html>There are a few scopes configured for the project.
zh_cn: <html>为项目配置了几个范围。

source: <html>There is not enough memory to perform the requested operation.<br>Please increase ''{0}'' setting and restart the IDE for change to take effect.</html>
zh_cn: <html>没有足够的内存来执行请求的操作。<br>请增加 ''{0}'' 设置并重启 IDE 使更改生效。</html>

source: <html>To change encoding {0} uses for a file or directory, click an item and then select encoding from the encoding list.
zh_cn: <html>要更改文件或目录使用的编码 {0} ，请单击某个项目，然后从编码列表中选择编码。

source: <html>To change encoding {0} uses for a file, a directory, or the entire project, add its path if necessary and then select encoding from the encoding list.
zh_cn: <html>要更改文件，目录或整个项目使用的编码 {0} ，添加它的路径（如果需要），然后从编码列表中选择编码。

source: <html>To improve your experience, we would like to collect data on the plugins and features you use.
zh_cn: <html>为了改善您的体验，我们希望收集您使用的插件和功能的数据。

source: <html>We are asking your permission to send information about your plugins configuration (what is enabled and what is not) and feature usage statistics (e.g. how frequently you are using code completion).
zh_cn: <html>我们正在请求您允许发送有关您的插件配置信息(启用了什么，未启用什么)和功能使用情况统计信息(例如您使用代码补全的频率)。

source: <html>When number of opened editors exceeds tab limit:</html>
zh_cn: <html>当打开的编辑窗口数超过选项卡限制时：</html>

source: <html>You already have the latest version of plugins installed.<br> IDE updates are managed externally and weren't checked.</html>
zh_cn: <html>您已经安装了最新版本的插件。<br>IDE 更新是外部管理的，没有被检查。</html>

source: <html>You are going to remove {0}{1}{2}.<br>This action cannot be undone.
zh_cn: <html>您将移除 {0} {1} {2}。<br>此操作无法撤消。

source: <html>You have JVM property "{0}" set to "{1}".<br>This may lead to incorrect behaviour.
zh_cn: <html>你的 JVM 属性 "{0}" 设置为 "{1}" 。<br>这可能导致不正确的行为。

source: <html>You have JVM property 'java.net.useSystemProxies' set to true.<br>This will cause some network calls to go through operating system-defined proxy.<br>If you didn't intend to use system-defined proxy, disable this property
zh_cn: <html>你的 JVM 属性 'java.net.useSystemProxies' 设置为 true。<br>该参数将使部分网络操作使用系统代理设置。<br>如果您不想使用系统代理设置, 请禁用该属性

source: <invalid frame>
zh_cn: <无效帧>

source: <invalid>
zh_cn: <无效>

source: <no attributes>
zh_cn: <无属性>

source: <no comment>
zh_cn: <无注释>

source: <no name>
zh_cn: <无名>

source: <no parameters>
zh_cn: <无参数>

source: <noname>
zh_cn: <没有名字>

source: <none>
zh_cn: <无>

source: <output root>
zh_cn: <输出根>

source: <params>
zh_cn: <参数>

source: &productName; allows you to search through the classes, files, tool windows, actions, settings, and symbols of your project by double pressing the Shift key.
zh_cn: &productName; 允许你搜索项目中的类，文件，工具窗口，操作，设置以及符号，只需双击 Shift 。

source: &productName; can work with several projects in one window.
zh_cn: &productName; 可以在一个窗口中操作多个项目。

source: &productName; enables you to perform the following types of comparison:
zh_cn: &productName; 使您可以执行以下类型的比较：

source: &productName; helps create test cases directly from class declaration.
zh_cn: &productName; 可以直接从类声明创建测试用例。

source: &productName; lets you enable drag-n-drop only with ALT key pressed.
zh_cn: &productName; 允许你只在按下 ALT 键时启用拖放功能。

source: &productName; makes it possible to launch the embedded local terminal using keyboard only.
zh_cn: &productName; 可以只使用键盘就启动内嵌的本地终端。

source: &productName; makes it possible to move a module or class to an upper level.
zh_cn: &productName; 可以将模块或类移动到较高级别。

source: &productName; simplifies your work with colors in Android resource files.
zh_cn: &productName; 简化了您的 Android 资源文件中的颜色工作。

source: &productName; simplifies your work with colors in CSS files.
zh_cn: &productName; 简化了你在 CSS 文件中颜色的工作。

source: &shortcut:CommentByBlockComment; encloses the selected block in a begin / end pair (=begin / ... =end).
zh_cn: &shortcut:CommentByBlockComment; 将所选块封装在 begin / end 对(=begin / ... =end)中。

source: &shortcut:CommentByBlockComment; encloses the selected block in a block comment (/*...*/).
zh_cn: &shortcut:CommentByBlockComment; 用块注释 (/*...*/)围住所选块。

source: &shortcut:CommentByLineComment; comments or uncomments the current line or selected block with single line comments (#...).
zh_cn: &shortcut:CommentByLineComment; 使用单行注释(#...)注释或取消注释当前行或所选块。

source: &shortcut:CommentByLineComment; comments or uncomments the current line or selected block with single line comments (//...).
zh_cn: &shortcut:CommentByLineComment; 使用单行注释(//...)来注释或取消注释单前行或所选块。

source: &shortcut:CommentByLineComment; comments or uncomments the current line or several selected lines with single line comments ({# in Django templates, or # in Python scripts).
zh_cn: &shortcut:CommentByLineComment; 使用单行注释来注释或取消注释当前行或选中的几行(用 Django 模板的 {# ，或 Python 脚本的 #)。

source: &shortcut:EditorDeleteLine; in the editor deletes the whole line at the caret.
zh_cn: &shortcut:EditorDeleteLine; 在编辑器中删除插入符处的一整行。

source: &shortcut:EditorDuplicate; in the editor duplicates the selected block or the current line when no block is selected.
zh_cn: &shortcut:EditorDuplicate; 可以在编辑器中重复所选块（如果没有选中块则重复当前行）。

source: &shortcut:EditorJoinLines; shortcut joins two lines into one and removes unnecessary space to match your code style.
zh_cn: &shortcut:EditorJoinLines; 将两行合并为一行，并移除不需要的空格以匹配你的代码样式。

source: &shortcut:EditorSelectWord; (extend selection) in the editor selects the word at the caret and then selects expanding areas of the source code.
zh_cn: &shortcut:EditorSelectWord; (扩展选择)在编辑器中选择插入符处的词，然后在源码中扩展选择区域。

source: &shortcut:HideActiveWindow; moves the focus to the editor and also hides the current (or last active) tool window.
zh_cn: &shortcut:HideActiveWindow; 将焦点移动到编辑器，同时也隐藏当前的(或上一次激活的)工具窗口。

source: &shortcut:JumpToLastChange; (Navigate | Last Edit Location) brings you back to the last place where you made changes in the code.
zh_cn: &shortcut:JumpToLastChange; (Navigate | Last Edit Location) 可以将你带回代码中你更改的上一个地方。

source: &shortcut:RecentFiles; (View | Recent Files) brings a popup list of the recently visited files.
zh_cn: &shortcut:RecentFiles; (View | Recent Files) 带来最近访问过的文件列表的弹窗。

source: * stands for any symbols.
zh_cn: * 代表任何符号。

source: Ctrl+Click (on Windows) or Cmd+Click (on MacOS) a tab in the editor to navigate to any part of the file path.
zh_cn: Ctrl+点击 (Windows) 或 Cmd+点击 (MacOS) 一个编辑器中的选项卡，可以导航到文件路径中的任何部分。

source: Ctrl+Click a tab in the editor to navigate to any part of the file path.
zh_cn: Ctrl+Click 一个编辑器中的选项卡，可以导航到文件路径中的任何部分。

source: Ctrl+Click(Windows or *nix)/ Cmd+Click (MacOS) a tab in the editor to navigate to any part of the file path.
zh_cn: Ctrl+Click(Windows 或* nix)/ Cmd+Click(MacOS)编辑器中的选项卡导航到文件路径的任何部分。

source: IntelliJ IDEA enables you to perform the following types of comparison:
zh_cn: &productName; 使您可以执行以下类型的比较：

source: IntelliJ IDEA helps create test cases directly from class declaration.
zh_cn: &productName; 可以直接从类声明创建测试用例。

source: TODO tool window lets you preview each of the encountered TODO items - just click the preview button on the toolbar.
zh_cn: TODO 工具窗口允许预览每个遇到的待办事项——只需单击工具栏上的预览按钮即可。

source: TODO tool window lets you preview each of the encountered TODO items – just click the preview button on the toolbar.
zh_cn: TODO 工具窗口允许预览每个遇到的待办事项——只需单击工具栏上的预览按钮即可。

source: <spot>Flashing rectangle</spot> shows the place where intention is applicable.
zh_cn: <spot>闪烁的矩形</spot> 显示意向适用的地方。

source: <table cellpadding=0 cellspacing=0 border=0><tr><td>Color preview:\&nbsp;</td><td style="background-color: #000000; padding: 1px">{0}</td></tr></table>
zh_cn: <table cellpadding=0 cellspacing=0 border=0><tr><td>颜色预览:\&nbsp;</td><td style="background-color: #000000; padding: 1px">{0}</td></tr></table>

source: <ul><li>Abstract method is not implemented OR</li><li>Implementation class is never instantiated OR</li><li>An instantiation is not reachable from entry points.</li></ul>
zh_cn: <ul><li>抽象方法没有实现，或</li><li>实现类没有实例化，或</li><li>一个实例从入口点不可到达。</li></ul>

source: <ul><li>Method owner class is never instantiated OR</li><li>An instantiation is not reachable from entry points.</li></ul>
zh_cn: <ul><li>方法所有者类没有实例化，或</li><li>一个实例从入口点不可到达。</li></ul>

source: <undefined>
zh_cn: <未定义>

source: <unknown scope>
zh_cn: <未知范围>

source: <unnamed>
zh_cn: <未命名的>

source: == used instead of equals()
zh_cn: 使用了 == 而不是 equals()

source: @NotNull/@Nullable problems
zh_cn: @NotNull / @Nullable 问题

source: @Override is not allowed when implementing interface method
zh_cn: 实现接口方法时，不允许使用 @Override

source: @interface
zh_cn: @接口

source: @interface may not have extends list
zh_cn: @interface 不应有扩展列表

source: @interface may not have type parameters
zh_cn: @interface 不应有类型参数

source: @interface members may not have parameters
zh_cn: @interface 成员不应有参数

source: @interface members may not have throws list
zh_cn: @interface 成员不应有 throws 列表

source: @interface members may not have type parameters
zh_cn: @interface 成员不应有类型参数

source: @throws or @exception
zh_cn: @throws 或 @exception

source: @value tag may not have any arguments when JDK 1.4 or earlier is used
zh_cn: 使用 JDK 1.4或更早版本时，@value 标记不应有任何参数

source: @value tag must reference a field
zh_cn: @value 标签必须引用一个字段

source: @value tag must reference a field with a constant initializer
zh_cn: @value 标签引用字侧面或常量初始化器

source: @value tag must reference a static field
zh_cn: @value 标签必须引用静态字段

source: A changelist named ''{0}'' already exists
zh_cn: 名为 ''{0}'' 的更改列表已经存在

source: A changelist with that name already exists
zh_cn: 该名称的更改列表已经存在

source: A custom dictionary is a mere textual file with a .dic extension, with each word starting on a new line.
zh_cn: 一个自定义词典只是一个带有 .dic 扩展名的文本文件，每个单词在一行。

source: A module content root is a directory where the files that belong to the module are stored.
zh_cn: 模块内容根目录是存储属于该模块的文件的目录。

source: A module file should not have 'package' statement
zh_cn: 模块文件不应该包含 'package' 语句

source: A module name cannot be empty
zh_cn: 模块名称不能为空

source: A name should be specified
zh_cn: 需指定名称

source: A named module cannot access packages of an unnamed one
zh_cn: 命名模块无法访问未命名的软件包

source: A newer version of the plugin is available
zh_cn: 插件的新版本可用

source: A non-expression can not be replaced with an expression
zh_cn: 非表达式不能用表达式替换

source: A prefix must be a sequence of words separated by dots
zh_cn: 前缀必须是由点分隔的单词序列

source: A prefix must be composed of characters which can be used in a file name
zh_cn: 前缀必须由可在文件名中使用的字符组成

source: A scheme with this name already exists or was deleted without applying the changes
zh_cn: 一个使用该名称的方案已经存在或已被删除而未应用更改

source: A special variant of the Code Completion feature invoked by pressing &shortcut:CodeCompletion; twice allows you to complete XML tag names from namespaces not declared in the current file.
zh_cn: 通过按两次 &shortcut:CodeCompletion; ，可以执行一个特殊的代码补体功能变体：可以从没有在当前文件中声明的命名空间中补全 XML 标签名称。

source: A special variant of the Code Completion feature invoked by pressing &shortcut:CodeCompletion; twice allows you to complete the name of any class no matter if it was imported in the current file or not.
zh_cn: 通过按两次 &shortcut:CodeCompletion; ，可以执行一个特殊的代码补体功能变体：可以允许你补全任何类名，不管它是否已导入当前文件。

source: A template with the same name already exists.
zh_cn: 具有相同名称的模板已经存在。

source: A value is expected
zh_cn: 期望值

source: A&bbreviation:
zh_cn: 缩写:(&B)

source: A&dd
zh_cn: 添加(&D)

source: A&dd...
zh_cn: 添加...(&D)

source: A&pply
zh_cn: 应用(&P)

source: ANSI Colors//Black
zh_cn: ANSI 颜色//黑

source: ANSI Colors//Blue
zh_cn: ANSI 颜色//蓝

source: ANSI Colors//Bright Blue
zh_cn: ANSI 颜色//亮蓝

source: ANSI Colors//Bright Cyan
zh_cn: ANSI 颜色//亮青

source: ANSI Colors//Bright Green
zh_cn: ANSI 颜色//亮绿

source: ANSI Colors//Bright Magenta
zh_cn: ANSI 颜色//亮洋红

source: ANSI Colors//Bright Red
zh_cn: ANSI 颜色//亮红

source: ANSI Colors//Bright Yellow
zh_cn: ANSI 颜色//亮黄

source: ANSI Colors//Cyan
zh_cn: ANSI 颜色//青

source: ANSI Colors//Dark Gray
zh_cn: ANSI 颜色//深灰

source: ANSI Colors//Gray
zh_cn: ANSI 颜色//灰

source: ANSI Colors//Green
zh_cn: ANSI 颜色//绿

source: ANSI Colors//Magenta
zh_cn: ANSI 颜色//洋红

source: ANSI Colors//Red
zh_cn: ANSI 颜色//红

source: ANSI Colors//White
zh_cn: ANSI 颜色//白

source: ANSI Colors//Yellow
zh_cn: ANSI 颜色//黄

source: ANT ''{0}'' is not configured
zh_cn: ANT ''{0}'' 未配置

source: ANT buildfiles
zh_cn: ANT 构建文件

source: A_nnotate
zh_cn: 注释(_N)

source: Abbreviate Qualified Package Names
zh_cn: 缩写限定包名

source: Abbreviation
zh_cn: 缩写

source: Abort
zh_cn: 中止

source: Absolute label indent
zh_cn: 绝对标签缩进

source: Abstract class is not allowed
zh_cn: 抽象类是不允许的

source: Abstract classes cannot be inlined
zh_cn: 抽象类不能被内联

source: Abstract method ''{0}'' cannot be accessed directly
zh_cn: 抽象方法 ''{0}'' 无法直接访问

source: Abstract method in non-abstract class
zh_cn: 非抽象类中的抽象方法

source: Abstract methods cannot have a body
zh_cn: 抽象方法不能有方法体

source: Abstract\&nbsp;class
zh_cn: 抽象类

source: Abstraction issues
zh_cn: 抽象问题

source: Accept
zh_cn: 接受

source: Accept &Theirs
zh_cn: 接受他们的(&T)

source: Accept &Yours
zh_cn: 接受你的(&Y)

source: Accept &subclasses as parameter to equals() method
zh_cn: 接受子类作为 equals() 方法的参数(&S)

source: Accept Changes
zh_cn: 接受更改

source: Accept Left Side
zh_cn: 接受左侧

source: Accept Resolution
zh_cn: 接受决议

source: Accept Right Side
zh_cn: 接受右侧

source: Accept all terms of the license
zh_cn: 接受许可协议的所有条款

source: Accept suggested access level
zh_cn: 接受建议的访问级别

source: Access can be tightened
zh_cn: 访问可以收紧

source: Access is denied.
zh_cn: 访问被拒绝。

source: Access static ''{1}.{0}'' via class ''{2}'' reference
zh_cn: 通过类 ''{2}'' 的引用访问静态 ''{1}.{0}''

source: Access static member via instance reference
zh_cn: 通过实例引用访问静态成员

source: Access static via class reference
zh_cn: 通过类引用访问静态

source: Access technical support on JetBrains Web site
zh_cn: 访问 JetBrains 网站的技术支持

source: Access to ''{0}'' in ''{1}'' is prevented by {2}
zh_cn: 对 ''{1}'' 中的 ''{0}'' 的访问被 {2} 阻止

source: Accessors' Visibility
zh_cn: 访问器可见性

source: Achromatopsia
zh_cn: 色盲

source: Across modu&le dependencies
zh_cn: 跨模块依赖关系(&L)

source: Action
zh_cn: 操作

source: Action Description
zh_cn: 操作说明

source: Action and directive content
zh_cn: 操作和指令内容

source: Action and directive name
zh_cn: 操作和指令名称

source: Action: {0}
zh_cn: 操作: {0}

source: Actions
zh_cn: 操作

source: Actions on Pairs of Files
zh_cn: 两个文件的操作

source: Actions that are not properly registered
zh_cn: 操作未正确注册

source: Activate Navigation _Bar
zh_cn: 激活导航栏(_B)

source: Activate last focused tool window
zh_cn: 激活上一个聚焦的工具窗口

source: Activate navigation bar
zh_cn: 激活导航栏

source: Activate next tab
zh_cn: 激活下一个选项卡

source: Activate previous tab
zh_cn: 激活上一个选项卡

source: Activate tool window
zh_cn: 激活工具窗口

source: Activate {0} window
zh_cn: 激活 {0} 窗口

source: Active
zh_cn: 激活

source: Active Editor
zh_cn: 活动编辑器

source: Active Tool Window
zh_cn: 激活工具窗口

source: Active scheme
zh_cn: 活动方案

source: Acts as the Backspace except that removes all whitespace symbols before the caret (if any)
zh_cn: 和退格键的行为一样，但会删除插入符之前的所有空白符号(如果有的话)

source: Actual
zh_cn: 实际

source: Actual :
zh_cn: 实际 :

source: Actual Size
zh_cn: 实际尺寸

source: Actual method parameter is the same constant
zh_cn: 实际方法参数是相同的常数

source: Actual size
zh_cn: 实际尺寸

source: Actual value of parameter ''{0}'' is always ''{1}''
zh_cn: 参数 ''{0}'' 的实际值始终为 ''{1}''

source: Add
zh_cn: 添加

source: Add "{0}" attribute
zh_cn: 添加 "{0}" 属性

source: Add &Keyboard Shortcut...
zh_cn: 添加键盘快捷键...(&K)

source: Add &Mouse Shortcut...
zh_cn: 添加鼠标快捷键...(&M)

source: Add &Package
zh_cn: 添加包(&P)

source: Add &Separator
zh_cn: 添加分隔符(&S)

source: Add &externally
zh_cn: 从外部添加(&E)

source: Add &object as a parameter to constructors with name:
zh_cn: 添加对象作为一个参数的构造函数，名称:(&O)

source: Add &object as a parameter with name:
zh_cn: 添加对象作为参数，名称:(&O)

source: Add ''new {0}[]''
zh_cn: 添加 ''new {0}[]''

source: Add ''requires {0}'' directive to module-info.java
zh_cn: 将 ''requires {0}'' 指令添加到 module-info.java

source: Add ''requires {0}'' statement to module-info.java
zh_cn: 将 ''requires {0}'' 语句添加到 module-info.java

source: Add ''{0}'' Library to Project
zh_cn: 将 ''{0}'' 库添加到项目中

source: Add ''{0}'' as {1, choice, 1#1st|2#2nd|3#3rd|4#{1,number}th} parameter to method ''{2}''
zh_cn: 将 ''{0}'' 添加为方法 ''{2}'' 的第 {1,number} 个参数

source: Add ''{0}'' to ''{1}'' throws list
zh_cn: 添加 ''{0}'' 到 ''{1}'' 抛出列表

source: Add ''{0}'' to special annotations list
zh_cn: 添加 ''{0}'' 到特殊注解列表

source: Add 'catch' clause(s)
zh_cn: 添加 'catch' 子句

source: Add 'requires' directive to module-info.java
zh_cn: 将 'require' 指令添加到 module-info.java

source: Add 'requires' statement to module-info.java
zh_cn: 将 'require' 语句添加到 module-info.java

source: Add 'return' statement
zh_cn: 添加 'return' 语句

source: Add </{0}>
zh_cn: 添加 </{0}>

source: Add <{0}> element
zh_cn: 添加 <{0}> 元素

source: Add A&fter...
zh_cn: 在...后添加...(&F)

source: Add A&ll in Directory
zh_cn: 将目录中的全部添加(&L)

source: Add A_ll To Favorites
zh_cn: 全部收藏(_L)

source: Add All Open Tabs To New Favorites List
zh_cn: 将所有打开的选项卡添加到新的收藏列表

source: Add Annotation
zh_cn: 添加注解

source: Add Annotation Class
zh_cn: 添加注解类

source: Add Annotations Pattern
zh_cn: 添加注解模式

source: Add Assert False Method
zh_cn: 添加断言 False 方法

source: Add Assert IsNotNull Method
zh_cn: 添加断言 IsNotNull 方法

source: Add Assert IsNull Method
zh_cn: 添加断言 IsNull 方法

source: Add Assert True Method
zh_cn: 添加断言 True 方法

source: Add Blank
zh_cn: 添加空白
